Revit 2024 API
BuiltInFailures.BendFailures.NotBentModelLine Property
 While making curved beam type "[Type Name]" some Model Line elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotBentModelLine { get; }
Visual Basic
Public Shared ReadOnly Property NotBentModelLine As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotBentModelLine {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace